lkolbly/cmsis-svd/data/TexasInstruments/LM3S9BN2.svd
        <register>
          <name>_0_GENB</name>
          <description>PWM0 Generator B Control</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>PWM_X_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBCTL</name>
          <description>PWM0 Dead-Band Control</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBRISE</name>
          <description>PWM0 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBRISE_DELAY</name>
              <description>Dead-Band Rise Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBFALL</name>
          <description>PWM0 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBFALL_DELAY</name>
              <description>Dead-Band Fall Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSRC0</name>
          <description>PWM0 Fault Source 0</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSRC0_FAULT0</name>
              <description>Fault0 Input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT2</name>
              <description>Fault2 Input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSRC1</name>
          <description>PWM0 Fault Source 1</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSRC1_DCMP0</name>
              <description>Digital Comparator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP1</name>
              <description>Digital Comparator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP2</name>
              <description>Digital Comparator 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP3</name>
              <description>Digital Comparator 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP4</name>
              <description>Digital Comparator 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP5</name>
              <description>Digital Comparator 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP6</name>
              <description>Digital Comparator 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC1_DCMP7</name>
              <description>Digital Comparator 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_MINFLTPER</name>
          <description>PWM0 Minimum Fault Period</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_CTL</name>
          <description>PWM1 Control</description>
          <addressOffset>0x00000080</addressOffset>
        </register>
        <register>
          <name>_1_INTEN</name>
          <description>PWM1 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000084</addressOffset>
        </register>
        <register>
          <name>_1_RIS</name>
          <description>PWM1 Raw Interrupt Status</description>
          <addressOffset>0x00000088</addressOffset>
        </register>
        <register>
          <name>_1_ISC</name>
          <description>PWM1 Interrupt Status and Clear</description>
          <addressOffset>0x0000008C</addressOffset>
        </register>
        <register>
          <name>_1_LOAD</name>
          <description>PWM1 Load</description>
          <addressOffset>0x00000090</addressOffset>
        </register>
        <register>
          <name>_1_COUNT</name>
          <description>PWM1 Counter</description>
          <addressOffset>0x00000094</addressOffset>
        </register>
        <register>
          <name>_1_CMPA</name>
          <description>PWM1 Compare A</description>
          <addressOffset>0x00000098</addressOffset>
        </register>
        <register>
          <name>_1_CMPB</name>
          <description>PWM1 Compare B</description>
          <addressOffset>0x0000009C</addressOffset>
        </register>
        <register>
          <name>_1_GENA</name>
          <description>PWM1 Generator A Control</description>
          <addressOffset>0x000000A0</addressOffset>
        </register>
        <register>
          <name>_1_GENB</name>
          <description>PWM1 Generator B Control</description>
          <addressOffset>0x000000A4</addressOffset>
        </register>
        <register>
          <name>_1_DBCTL</name>
          <description>PWM1 Dead-Band Control</description>
          <addressOffset>0x000000A8</addressOffset>
        </register>
        <register>
          <name>_1_DBRISE</name>
          <description>PWM1 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000AC</addressOffset>
        </register>
        <register>
          <name>_1_DBFALL</name>
          <description>PWM1 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000B0</addressOffset>
        </register>
        <register>
          <name>_1_FLTSRC0</name>
          <description>PWM1 Fault Source 0</description>
          <addressOffset>0x000000B4</addressOffset>
        </register>
        <register>
          <name>_1_FLTSRC1</name>
          <description>PWM1 Fault Source 1</description>
          <addressOffset>0x000000B8</addressOffset>
        </register>
        <register>
          <name>_1_MINFLTPER</name>
          <description>PWM1 Minimum Fault Period</description>
          <addressOffset>0x000000BC</addressOffset>
        </register>
        <register>
          <name>_2_CTL</name>
          <description>PWM2 Control</description>
          <addressOffset>0x000000C0</addressOffset>
        </register>
        <register>
          <name>_2_INTEN</name>
          <description>PWM2 Interrupt and Trigger Enable</description>
          <addressOffset>0x000000C4</addressOffset>
        </register>
        <register>
          <name>_2_RIS</name>
          <description>PWM2 Raw Interrupt Status</description>
          <addressOffset>0x000000C8</addressOffset>
        </register>
        <register>
          <name>_2_ISC</name>
          <description>PWM2 Interrupt Status and Clear</description>
          <addressOffset>0x000000CC</addressOffset>
        </register>
        <register>
          <name>_2_LOAD</name>
          <description>PWM2 Load</description>
          <addressOffset>0x000000D0</addressOffset>
        </register>
        <register>
          <name>_2_COUNT</name>
          <description>PWM2 Counter</description>
          <addressOffset>0x000000D4</addressOffset>
        </register>
        <register>
          <name>_2_CMPA</name>
          <description>PWM2 Compare A</description>
          <addressOffset>0x000000D8</addressOffset>
        </register>
        <register>
          <name>_2_CMPB</name>
          <description>PWM2 Compare B</description>
          <addressOffset>0x000000DC</addressOffset>
        </register>
        <register>
          <name>_2_GENA</name>
          <description>PWM2 Generator A Control</description>
          <addressOffset>0x000000E0</addressOffset>
        </register>
        <register>
          <name>_2_GENB</name>
          <description>PWM2 Generator B Control</description>
          <addressOffset>0x000000E4</addressOffset>
        </register>
        <register>
          <name>_2_DBCTL</name>
          <description>PWM2 Dead-Band Control</description>
          <addressOffset>0x000000E8</addressOffset>
        </register>
        <register>
          <name>_2_DBRISE</name>
          <description>PWM2 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000EC</addressOffset>
        </register>
        <register>
          <name>_2_DBFALL</name>
          <description>PWM2 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000F0</addressOffset>
        </register>
        <register>
          <name>_2_FLTSRC0</name>
          <description>PWM2 Fault Source 0</description>
          <addressOffset>0x000000F4</addressOffset>
        </register>
        <register>
          <name>_2_FLTSRC1</name>
          <description>PWM2 Fault Source 1</description>
          <addressOffset>0x000000F8</addressOffset>
        </register>
        <register>
          <name>_2_MINFLTPER</name>
          <description>PWM2 Minimum Fault Period</description>
          <addressOffset>0x000000FC</addressOffset>
        </register>
        <register>
          <name>_3_CTL</name>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
        </register>
        <register>
          <name>_3_INTEN</name>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
        </register>
        <register>
          <name>_3_RIS</name>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
        </register>
        <register>
          <name>_3_ISC</name>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
        </register>
        <register>
          <name>_3_LOAD</name>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
        </register>
        <register>
          <name>_3_COUNT</name>
          <description>PWM3 Counter</description>
          <addressOffset>0x00000114</addressOffset>
        </register>
        <register>
          <name>_3_CMPA</name>
          <description>PWM3 Compare A</description>
          <addressOffset>0x00000118</addressOffset>
        </register>
        <register>
          <name>_3_CMPB</name>
          <description>PWM3 Compare B</description>
          <addressOffset>0x0000011C</addressOffset>
        </register>
        <register>
          <name>_3_GENA</name>
          <description>PWM3 Generator A Control</description>
          <addressOffset>0x00000120</addressOffset>
        </register>
        <register>
          <name>_3_GENB</name>
          <description>PWM3 Generator B Control</description>
          <addressOffset>0x00000124</addressOffset>
        </register>
        <register>
          <name>_3_DBCTL</name>
          <description>PWM3 Dead-Band Control</description>
          <addressOffset>0x00000128</addressOffset>
        </register>
        <register>
          <name>_3_DBRISE</name>
          <description>PWM3 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000012C</addressOffset>
        </register>
        <register>
          <name>_3_DBFALL</name>
          <description>PWM3 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000130</addressOffset>
        </register>
        <register>
          <name>_3_FLTSRC0</name>
          <description>PWM3 Fault Source 0</description>
          <addressOffset>0x00000134</addressOffset>
        </register>
        <register>
          <name>_3_FLTSRC1</name>
          <description>PWM3 Fault Source 1</description>
          <addressOffset>0x00000138</addressOffset>
        </register>
        <register>
          <name>_3_MINFLTPER</name>
          <description>PWM3 Minimum Fault Period</description>
          <addressOffset>0x0000013C</addressOffset>
        </register>
        <register>
          <name>_0_FLTSEN</name>
          <description>PWM0 Fault Pin Logic Sense</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT0</name>
          <description>PWM0 Fault Status 0</description>
          <addressOffset>0x00000804</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
