lkolbly/cmsis-svd/data/TexasInstruments/LM3S9BN2.svd
        <register>
          <name>MPU_BASE</name>
          <description>MPU Region Base Address</description>
          <addressOffset>0x00000D9C</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR</name>
          <description>MPU Region Attribute and Size</description>
          <addressOffset>0x00000DA0</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32B</name>
                  <description>Region size 32 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64B</name>
                  <description>Region size 64 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128B</name>
                  <description>Region size 128 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256B</name>
                  <description>Region size 256 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512B</name>
                  <description>Region size 512 bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1K</name>
                  <description>Region size 1 Kbytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2K</name>
                  <description>Region size 2 Kbytes</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4K</name>
                  <description>Region size 4 Kbytes</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_8K</name>
                  <description>Region size 8 Kbytes</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_16K</name>
                  <description>Region size 16 Kbytes</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32K</name>
                  <description>Region size 32 Kbytes</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64K</name>
                  <description>Region size 64 Kbytes</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128K</name>
                  <description>Region size 128 Kbytes</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256K</name>
                  <description>Region size 256 Kbytes</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512K</name>
                  <description>Region size 512 Kbytes</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1M</name>
                  <description>Region size 1 Mbytes</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2M</name>
                  <description>Region size 2 Mbytes</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4M</name>
                  <description>Region size 4 Mbytes</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_8M</name>
                  <description>Region size 8 Mbytes</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_16M</name>
                  <description>Region size 16 Mbytes</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32M</name>
                  <description>Region size 32 Mbytes</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64M</name>
                  <description>Region size 64 Mbytes</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128M</name>
                  <description>Region size 128 Mbytes</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256M</name>
                  <description>Region size 256 Mbytes</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512M</name>
                  <description>Region size 512 Mbytes</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1G</name>
                  <description>Region size 1 Gbytes</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2G</name>
                  <description>Region size 2 Gbytes</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4G</name>
                  <description>Region size 4 Gbytes</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_0</name>
                  <description>Sub-region 0 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_1</name>
                  <description>Sub-region 1 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_2</name>
                  <description>Sub-region 2 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_3</name>
                  <description>Sub-region 3 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_4</name>
                  <description>Sub-region 4 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_5</name>
                  <description>Sub-region 5 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_6</name>
                  <description>Sub-region 6 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_7</name>
                  <description>Sub-region 7 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_NO_NO</name>
                  <description>prv: no access, usr: no access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_NO</name>
                  <description>prv: rw, usr: none</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_RO</name>
                  <description>prv: rw, usr: read-only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_RW</name>
                  <description>prv: rw, usr: rw</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RO_NO</name>
                  <description>prv: ro, usr: none</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RO_RO</name>
                  <description>prv: ro, usr: ro</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE1</name>
          <description>MPU Region Base Address Alias 1</description>
          <addressOffset>0x00000DA4</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE1_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR1</name>
          <description>MPU Region Attribute and Size Alias 1</description>
          <addressOffset>0x00000DA8</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR1_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE2</name>
          <description>MPU Region Base Address Alias 2</description>
          <addressOffset>0x00000DAC</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE2_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR2</name>
          <description>MPU Region Attribute and Size Alias 2</description>
          <addressOffset>0x00000DB0</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR2_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE3</name>
          <description>MPU Region Base Address Alias 3</description>
          <addressOffset>0x00000DB4</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE3_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR3</name>
          <description>MPU Region Attribute and Size Alias 3</description>
          <addressOffset>0x00000DB8</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR3_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CTRL</name>
          <description>Debug Control and Status Reg</description>
          <addressOffset>0x00000DF0</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_CTRL_C_DEBUGEN</name>
              <description>Enable debug</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_HALT</name>
              <description>Halt the core</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_STEP</name>
              <description>Step the core</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_MASKINT</name>
              <description>Mask interrupts when stepping</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_SNAPSTALL</name>
              <description>Breaks a stalled load/store</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_REGRDY</name>
              <description>Register read/write available</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_HALT</name>
              <description>Core status on halt</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_SLEEP</name>
              <description>Core is sleeping</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_LOCKUP</name>
              <description>Core is locked up</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RETIRE_ST</name>
              <description>Core has executed insruction since last read</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RESET_ST</name>
              <description>Core has reset since last read</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
